---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetRepresentations
source: html/87d64bab-218f-7dab-8e0a-7e2a8be2543f.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetRepresentations Method

Gets the representation handles created representing the processed geometry and stored in this object.

## Syntax (C#)
```csharp
public ICollection<IFCAnyHandle> GetRepresentations()
```

## Returns
The collection of representation handles.